Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.SetCycleCounter(System.Int32)
Sets the cycle counter to a specific value.
Remarks:
The actual value is set into the rebar after the curves computation.
This function can be called to reset the counter to zero or to another value.
The cycle counter value is changed when the free form Rebar element is selected and the user press Space key
-or- by through Autodesk::Revit::DB::Structure::RebarRebarFreeFormAccessor::CycleCounter property.
-or- by the server if it considers that the counter reaches the maximum value and reset it (set it to 0).
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for cycleCounter is negative.
Since:
2024

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetCycleCounter
Gets the cycle counter that is stored in the rebar.
Remarks:
The cycle counter value is changed when the free form Rebar element is selected and the user press Space key
-or- by through Autodesk::Revit::DB::Structure::RebarRebarFreeFormAccessor::CycleCounter property.
-or- by the server if it considers that the counter reaches the maximum value and reset it (set it to 0).
Returns:
Returns the cycle counter.
Since:
2024

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetRebarId
Get the id of the Rebar element currently being calculated.
Returns:
returns the id of the Rebar element currently being calculated
Since:
2020

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.SetHookPlaneNormalForBarIdx(System.Int32,System.Int32,Autodesk.Revit.DB.XYZ)
Set the normal of plane in which the hook at end of bar with index barPositionIndex will stay. This information is set to the rebar after the API execution is finished successfully.
Remarks:
This information is set to the rebar after the API execution is finished successfully. Before setting the value a validation will be done.
We consider a hook plane normal valid if it isn't parallel with the bar direction at end.
end:
The end of bar. Should be 0 for start or 1 for end.
barPositionIndex:
Index of the bar for which it will set hook plane normal.
hookNormal:
The normal of plane in which the hook at end of bar with index barPositionIndex will stay.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Invalid end.
-or-
hookNormal has zero length.
Since:
2018

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetBarNominalDiameter
Gets the nominal diameter of the Rebar.
Returns:
Returns the nominal diameter of the Rebar.
Since:
2022

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetBarModelDiameter
Gets the model diameter of the Rebar.
Returns:
Returns the model diameter of the Rebar.
Since:
2022

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetChangedSharedParameterGUIDs
Returns an array containing the shared parameter GUIDs that were changed since the last regeneration.
Array is empty if no shared params were changed since the last regeneration.
Returns:
Returns an array containing the elementId of the shared params that were changed since the last regeneration.
Since:
2020

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.AlignedFreeFormSetOrientationOptions
Orientation options for an Aligned Free Form Rebar set.
Since:
2024

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.AreOrientationOptionsChanged
Indicates if the orientation options have changed since the last regeneration.
Since:
2024

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.CycleCounterChanged
True if the cycle counter was changed, false otherwise.
The cycle counter value is changed when the free form Rebar element is selected and the user press Space key
-or- by through Autodesk::Revit::DB::Structure::RebarRebarFreeFormAccessor::CycleCounter property.
-or- by the server if it considers that the counter reaches the maximum value and reset it (set it to 0).
Since:
2024

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.ErrorMessage
The reason for calculation failure. If the calculation fails, this message will be shown in an error, or warning if we are editing the constraints.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: errorMessage is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2018.1

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.IsBendingRadiusChanged
Indicates if the bending radius has changed since the last regeneration.
Since:
2018